-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: 2018-05-03 00:51:06
-- 服务器版本： 5.7.19
-- PHP Version: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dypj`
--

-- --------------------------------------------------------

--
-- 表的结构 `duanp`
--

DROP TABLE IF EXISTS `duanp`;
CREATE TABLE IF NOT EXISTS `duanp` (
  `dpID` int(11) NOT NULL AUTO_INCREMENT,
  `mvID` int(11) NOT NULL,
  `content` text NOT NULL,
  `hzs` int(11) NOT NULL,
  `rating` char(50) NOT NULL,
  `ctime` date NOT NULL,
  `biaoti` char(60) NOT NULL,
  `userID` int(11) NOT NULL,
  `mys` int(11) NOT NULL,
  `yyyh` char(200) DEFAULT NULL,
  `myyh` char(200) DEFAULT NULL,
  PRIMARY KEY (`dpID`),
  KEY `userID` (`userID`),
  KEY `duanp_ibfk_1` (`mvID`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `duanp`
--

INSERT INTO `duanp` (`dpID`, `mvID`, `content`, `hzs`, `rating`, `ctime`, `biaoti`, `userID`, `mys`, `yyyh`, `myyh`) VALUES
(4, 7, 'å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–', 1, '3', '2018-04-23', 'å“ˆå“ˆ', 6, 0, '1x', NULL),
(6, 8, 'å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–å“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆå“ˆæˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–æˆ–', 2, '4', '2018-04-23', 'å“ˆå“ˆ', 6, 0, '7x1x', ''),
(8, 8, 'é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¥¿é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¥¿é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¹…é¥¿', 1, '3', '2018-04-26', 'å—¯å—¯', 4, 0, '1x', ''),
(9, 8, 'å‡„å‡„åˆ‡åˆ‡ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤å‡„å‡„åˆ‡åˆ‡ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤å‡„å‡„åˆ‡åˆ‡ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤ç¾¤', 1, '4', '2018-04-26', 'äº²æˆš', 1, 0, '1x', ''),
(10, 8, 'å¾é—®æ— ä¸ºè°“æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— å¾é—®æ— ä¸ºè°“æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— å¾é—®æ— ä¸ºè°“æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— æ— ', 0, '4', '2018-04-26', 'å¾€å¾€', 2, 0, '', NULL),
(11, 8, 'æŸ”æŸ”å¼±å¼±è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥æŸ”æŸ”å¼±å¼±è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥æŸ”æŸ”å¼±å¼±è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥è‹¥', 2, '4', '2018-04-26', 'è®©äºº', 8, 0, '7x1x', ''),
(12, 8, 'åžåžååæ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–åžåžååæ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–åžåžååæ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–æ‹–', 2, '3', '2018-04-26', 'å¤©å¤©', 7, 0, '7x1x', ''),
(13, 12, 'å•›å•›å–³å–³é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™å•›å•›å–³å–³é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™å•›å•›å–³å–³é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™é”™', 0, '4', '2018-05-01', 'è´¢äº§', 6, 0, NULL, NULL),
(14, 5, 'ä¸€æœˆåˆä¸€æœˆæ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•ä¸€æœˆåˆä¸€æœˆæ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•ä¸€æœˆåˆä¸€æœˆæ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•æ™•', 1, '4', '2018-05-02', 'å¶è¯­', 6, 0, '6x', '');

--
-- 限制导出的表
--

--
-- 限制表 `duanp`
--
ALTER TABLE `duanp`
  ADD CONSTRAINT `duanp_ibfk_1` FOREIGN KEY (`mvID`) REFERENCES `movies` (`mvID`),
  ADD CONSTRAINT `duanp_ibfk_2` FOREIGN KEY (`userID`) REFERENCES `users` (`userID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
